{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 40, 34], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "bidirectional_2", "class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]]}, {"name": "time_distributed_1", "class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]]}, {"name": "time_distributed_2", "class_name": "TimeDistributed", "config": {"name": "time_distributed_2", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_3", "class_name": "TimeDistributed", "config": {"name": "time_distributed_3", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_4", "class_name": "TimeDistributed", "config": {"name": "time_distributed_4", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_5", "class_name": "TimeDistributed", "config": {"name": "time_distributed_5", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_6", "class_name": "TimeDistributed", "config": {"name": "time_distributed_6", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_7", "class_name": "TimeDistributed", "config": {"name": "time_distributed_7", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_8", "class_name": "TimeDistributed", "config": {"name": "time_distributed_8", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_9", "class_name": "TimeDistributed", "config": {"name": "time_distributed_9", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_10", "class_name": "TimeDistributed", "config": {"name": "time_distributed_10", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_11", "class_name": "TimeDistributed", "config": {"name": "time_distributed_11", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_12", "class_name": "TimeDistributed", "config": {"name": "time_distributed_12", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_22", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_13", "class_name": "TimeDistributed", "config": {"name": "time_distributed_13", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_14", "class_name": "TimeDistributed", "config": {"name": "time_distributed_14", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_26", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_15", "class_name": "TimeDistributed", "config": {"name": "time_distributed_15", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_28", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_16", "class_name": "TimeDistributed", "config": {"name": "time_distributed_16", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_17", "class_name": "TimeDistributed", "config": {"name": "time_distributed_17", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_32", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_18", "class_name": "TimeDistributed", "config": {"name": "time_distributed_18", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_34", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_19", "class_name": "TimeDistributed", "config": {"name": "time_distributed_19", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_36", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_20", "class_name": "TimeDistributed", "config": {"name": "time_distributed_20", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_38", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_21", "class_name": "TimeDistributed", "config": {"name": "time_distributed_21", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_40", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_22", "class_name": "TimeDistributed", "config": {"name": "time_distributed_22", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_42", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_23", "class_name": "TimeDistributed", "config": {"name": "time_distributed_23", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_44", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "time_distributed_24", "class_name": "TimeDistributed", "config": {"name": "time_distributed_24", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_46", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "silence", "class_name": "TimeDistributed", "config": {"name": "silence", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]]}, {"name": "diphthong", "class_name": "TimeDistributed", "config": {"name": "diphthong", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_3", 0, 0, {}]]]}, {"name": "back", "class_name": "TimeDistributed", "config": {"name": "back", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_4", 0, 0, {}]]]}, {"name": "closed", "class_name": "TimeDistributed", "config": {"name": "closed", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_5", 0, 0, {}]]]}, {"name": "rounded", "class_name": "TimeDistributed", "config": {"name": "rounded", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_6", 0, 0, {}]]]}, {"name": "vowel", "class_name": "TimeDistributed", "config": {"name": "vowel", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_7", 0, 0, {}]]]}, {"name": "voiceless", "class_name": "TimeDistributed", "config": {"name": "voiceless", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_8", 0, 0, {}]]]}, {"name": "postalveolar", "class_name": "TimeDistributed", "config": {"name": "postalveolar", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_9", 0, 0, {}]]]}, {"name": "open", "class_name": "TimeDistributed", "config": {"name": "open", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_10", 0, 0, {}]]]}, {"name": "velar", "class_name": "TimeDistributed", "config": {"name": "velar", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_11", 0, 0, {}]]]}, {"name": "nasal", "class_name": "TimeDistributed", "config": {"name": "nasal", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_12", 0, 0, {}]]]}, {"name": "alveolar", "class_name": "TimeDistributed", "config": {"name": "alveolar", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_13", 0, 0, {}]]]}, {"name": "bilabial", "class_name": "TimeDistributed", "config": {"name": "bilabial", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_27", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_14", 0, 0, {}]]]}, {"name": "front", "class_name": "TimeDistributed", "config": {"name": "front", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_29", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_15", 0, 0, {}]]]}, {"name": "glottal", "class_name": "TimeDistributed", "config": {"name": "glottal", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_31", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_16", 0, 0, {}]]]}, {"name": "voiced", "class_name": "TimeDistributed", "config": {"name": "voiced", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_33", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_17", 0, 0, {}]]]}, {"name": "fricative", "class_name": "TimeDistributed", "config": {"name": "fricative", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_35", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_18", 0, 0, {}]]]}, {"name": "approximant", "class_name": "TimeDistributed", "config": {"name": "approximant", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_37", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_19", 0, 0, {}]]]}, {"name": "labiodental", "class_name": "TimeDistributed", "config": {"name": "labiodental", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_39", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_20", 0, 0, {}]]]}, {"name": "dental", "class_name": "TimeDistributed", "config": {"name": "dental", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_41", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_21", 0, 0, {}]]]}, {"name": "plosive", "class_name": "TimeDistributed", "config": {"name": "plosive", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_43", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_22", 0, 0, {}]]]}, {"name": "trill", "class_name": "TimeDistributed", "config": {"name": "trill", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_45", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_23", 0, 0, {}]]]}, {"name": "lateral", "class_name": "TimeDistributed", "config": {"name": "lateral", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_47", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_24", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["silence", 0, 0], ["diphthong", 0, 0], ["back", 0, 0], ["closed", 0, 0], ["rounded", 0, 0], ["vowel", 0, 0], ["voiceless", 0, 0], ["postalveolar", 0, 0], ["open", 0, 0], ["velar", 0, 0], ["nasal", 0, 0], ["alveolar", 0, 0], ["bilabial", 0, 0], ["front", 0, 0], ["glottal", 0, 0], ["voiced", 0, 0], ["fricative", 0, 0], ["approximant", 0, 0], ["labiodental", 0, 0], ["dental", 0, 0], ["plosive", 0, 0], ["trill", 0, 0], ["lateral", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}